In [1]:
import pandas as pd

In [10]:
dataset = pd.read_csv(r"C:\Users\window\Downloads\archive (1)\users_data.csv")
dataset

,user_id,first_name,last_name,age,gender,birthdate,sign_up_date,user_location,subscription_plan
0,user_1,Chris,Wilson,56,Female,2000-02-29,2023-02-06,Denver,Basic
1,user_2,Michael,Miller,46,Non-binary,1978-12-22,2023-08-08,Orlando,Pro
2,user_3,Daniel,Smith,32,Female,1962-08-30,2021-01-11,Orlando,Basic
3,user_4,David,Smith,60,Male,2003-12-05,2023-08-07,Denver,Pro
4,user_5,Chris,Jones,25,Female,2004-08-25,2021-01-08,Denver,Basic
...,...,...,...,...,...,...,...,...,...
4995,user_4996,Sarah,Williams,33,Male,1958-01-13,2021-08-08,Las Vegas,Basic
4996,user_4997,Linda,Brown,22,Male,1974-02-20,2023-01-22,Austin,Student
4997,user_4998,Emily,Miller,38,Non-binary,1978-03-29,2021-04-16,Atlanta,Pro
4998,user_4999,Robert,Garcia,27,Male,2002-02-01,2022-07-02,Denver,Pro
4999,user_5000,Chris,Smith,36,Male,1959-11-21,2022-02-20,Seattle,Student

In [11]:
dataset.head(2)

,user_id,first_name,last_name,age,gender,birthdate,sign_up_date,user_location,subscription_plan
0,user_1,Chris,Wilson,56,Female,2000-02-29,2023-02-06,Denver,Basic
1,user_2,Michael,Miller,46,Non-binary,1978-12-22,2023-08-08,Orlando,Pro

In [12]:
dataset.tail(2)

,user_id,first_name,last_name,age,gender,birthdate,sign_up_date,user_location,subscription_plan
4998,user_4999,Robert,Garcia,27,Male,2002-02-01,2022-07-02,Denver,Pro
4999,user_5000,Chris,Smith,36,Male,1959-11-21,2022-02-20,Seattle,Student

In [17]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            5000 non-null   object
 1   first_name         5000 non-null   object
 2   last_name          5000 non-null   object
 3   age                5000 non-null   int64
 4   gender             5000 non-null   object
 5   birthdate          5000 non-null   object
 6   sign_up_date       5000 non-null   object
 7   user_location      5000 non-null   object
 8   subscription_plan  5000 non-null   object
dtypes: int64(1), object(8)
memory usage: 351.7+ KB

In [16]:
dataset.isnull().sum()

user_id              0
first_name           0
last_name            0
age                  0
gender               0
birthdate            0
sign_up_date         0
user_location        0
subscription_plan    0
dtype: int64

In [18]:
dataset.describe()

              age
count  5000.00000
mean     41.16820
std      13.53105
min      18.00000
25%      29.00000
50%      41.00000
75%      53.00000
max      64.00000

In [19]:
dataset.count()

user_id              5000
first_name           5000
last_name            5000
age                  5000
gender               5000
birthdate            5000
sign_up_date         5000
user_location        5000
subscription_plan    5000
dtype: int64

In [21]:
dataset.shape

(5000, 9)

In [22]:
print(f"Number of Rows: {dataset.shape[0]} \nNumber of Columns: {dataset.shape[1]}")

Number of Rows: 5000
Number of Columns: 9

In [23]:
dataset['first_name'].unique()

array(['Chris', 'Michael', 'Daniel', 'David', 'Jessica', 'Linda', 'Jane',
       'Robert', 'John', 'Sarah', 'Emily', 'Laura'], dtype=object)

In [24]:
dataset.nunique()

user_id              5000
first_name             12
last_name              12
age                    47
gender                  3
birthdate            4363
sign_up_date         1013
user_location          10
subscription_plan       3
dtype: int64

In [25]:
dataset['age'].unique()

array([56, 46, 32, 60, 25, 38, 36, 40, 28, 41, 53, 57, 20, 39, 19, 61, 47,
       55, 50, 29, 42, 44, 59, 45, 33, 64, 54, 24, 26, 35, 21, 31, 43, 37,
       52, 34, 23, 51, 27, 48, 62, 58, 18, 22, 30, 49, 63], dtype=int64)